import img1 from './images/1.jpg'
import img2 from './images/2.jpg'
import img3 from './images/3.jpg'
import img4 from './images/4.jpg'
import img5 from './images/5.jpg'
import img6 from './images/6.jpg'
import img7 from './images/7.jpg'
import img8 from './images/8.jpg'
import img9 from './images/9.jpg'

export const mockImages = [
  {
    src: img1.src,
    alt: 'Обложка книги «Мастер и Маргарита» Михаила Булгакова',
  },
  {
    src: img2.src,
    alt: 'Обложка книги «Преступление и наказание» Фёдора Достоевского',
  },
  {
    src: img3.src,
    alt: 'Обложка книги «Война и мир» Льва Толстого',
  },
  {
    src: img4.src,
    alt: 'Обложка книги «Евгений Онегин» Александра Пушкина',
  },
  {
    src: img5.src,
    alt: 'Обложка книги «Собачье сердце» Михаила Булгакова',
  },
  {
    src: img6.src,
    alt: 'Обложка книги «Идиот» Фёдора Достоевского',
  },
  {
    src: img7.src,
    alt: 'Обложка книги «Идиот» Фёдора Достоевского',
  },
  {
    src: img8.src,
    alt: 'Обложка книги «Идиот» Фёдора Достоевского',
  },
  {
    src: img9.src,
    alt: 'Обложка книги «Идиот» Фёдора Достоевского',
  },
]

export const mockData = {
  id: '1',
  title: 'Мастер и Маргарита',
  author: 'Михаил Булгаков',
  images: mockImages,
  description:
    'Эта книга рассказывает о жизни и судьбе главного героя, который попадает в мир, где все люди и животные могут разговаривать. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогать персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие.',
  publisher: 'Издательство «АСТ»',
  yearPublisher: '1928',
  binding: 'Жесткий',
  pages: '213',
  genre: ['Фантастика'],
  bookLanguage: 'Русский',
  bookState: 'Хорошое',
  liked: false,
}
