export const mockImages = [
  {
    src: 'https://picsum.photos/seed/book1/400/600',
    alt: 'Обложка книги «Мастер и Маргарита» Михаила Булгакова',
    liked: true,
  },
  {
    src: 'https://picsum.photos/seed/book2/400/600',
    alt: 'Обложка книги «Преступление и наказание» Фёдора Достоевского',
    liked: false,
  },
  {
    src: 'https://picsum.photos/seed/book3/400/600',
    alt: 'Обложка книги «Война и мир» Льва Толстого',
    liked: false,
  },
  {
    src: 'https://picsum.photos/seed/book4/400/600',
    alt: 'Обложка книги «Евгений Онегин» Александра Пушкина',
    liked: false,
  },
  {
    src: 'https://picsum.photos/seed/book5/400/600',
    alt: 'Обложка книги «Собачье сердце» Михаила Булгакова',
    liked: false,
  },
  {
    src: 'https://picsum.photos/seed/book6/400/600',
    alt: 'Обложка книги «Идиот» Фёдора Достоевского',
    liked: false,
  },
  {
    src: 'https://picsum.photos/seed/book7/400/600',
    alt: 'Обложка книги «Идиот» Фёдора Достоевского',
    liked: false,
  },
  {
    src: 'https://picsum.photos/seed/book8/400/600',
    alt: 'Обложка книги «Идиот» Фёдора Достоевского',
    liked: false,
  },
  {
    src: 'https://picsum.photos/seed/book9/400/600',
    alt: 'Обложка книги «Идиот» Фёдора Достоевского',
    liked: false,
  },
]

export const mockData = {
  id: '1',
  title: 'Мастер и Маргарита',
  author: 'Михаил Булгаков',
  images: mockImages,
  description:
    'Эта книга рассказывает о жизни и судьбе главного героя, который попадает в мир, где все люди и животные могут разговаривать. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогать персонажей и их взаимодействие. Книга написана в виде диалогов и монологов, которые помогают понять персонажей и их взаимодействие.',
  publisher: 'Издательство «АСТ»',
  yearPublisher: '1928',
  binding: 'Жесткий',
  pages: '213',
  genre: ['Фантастика'],
  bookLanguage: 'Русский',
  bookState: 'Хорошое',
}
